## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## . :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_address.nat will be created
+   resource "google_compute_address" "nat" {
+       address            = (known after apply)
+       address_type       = "EXTERNAL"
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "nat"
+       network_tier       = "STANDARD"
+       project            = (known after apply)
+       purpose            = (known after apply)
+       region             = "us-central1"
+       self_link          = (known after apply)
+       subnetwork         = (known after apply)
+       users              = (known after apply)
    }

  # google_compute_firewall.allow_ssh will be created
+   resource "google_compute_firewall" "allow_ssh" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = (known after apply)
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "allow-ssh"
+       network            = "network"
+       priority           = 1000
+       project            = (known after apply)
+       self_link          = (known after apply)
+       source_ranges      = [
+           "0.0.0.0/0",
        ]

+       allow {
+           ports    = [
+               "22",
            ]
+           protocol = "tcp"
        }
    }

  # google_compute_network.vpc_network will be created
+   resource "google_compute_network" "vpc_network" {
+       auto_create_subnetworks         = false
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       internal_ipv6_range             = (known after apply)
+       mtu                             = 1460
+       name                            = "network"
+       project                         = (known after apply)
+       routing_mode                    = "REGIONAL"
+       self_link                       = (known after apply)
    }

  # google_compute_router.router will be created
+   resource "google_compute_router" "router" {
+       creation_timestamp = (known after apply)
+       id                 = (known after apply)
+       name               = "router"
+       network            = (known after apply)
+       project            = (known after apply)
+       region             = "us-central1"
+       self_link          = (known after apply)
    }

  # google_compute_router_nat.nat will be created
+   resource "google_compute_router_nat" "nat" {
+       enable_dynamic_port_allocation      = (known after apply)
+       enable_endpoint_independent_mapping = true
+       icmp_idle_timeout_sec               = 30
+       id                                  = (known after apply)
+       name                                = "nat"
+       nat_ip_allocate_option              = "AUTO_ONLY"
+       project                             = (known after apply)
+       region                              = "us-central1"
+       router                              = "router"
+       source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
+       tcp_established_idle_timeout_sec    = 1200
+       tcp_time_wait_timeout_sec           = 120
+       tcp_transitory_idle_timeout_sec     = 30
+       udp_idle_timeout_sec                = 30
    }

  # google_compute_subnetwork.private-subnet will be created
+   resource "google_compute_subnetwork" "private-subnet" {
+       creation_timestamp         = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       ip_cidr_range              = "10.0.0.0/18"
+       ipv6_cidr_range            = (known after apply)
+       name                       = "private-subnet"
+       network                    = (known after apply)
+       private_ip_google_access   = true
+       private_ipv6_google_access = (known after apply)
+       project                    = (known after apply)
+       purpose                    = (known after apply)
+       region                     = "us-central1"
+       secondary_ip_range         = [
+           {
+               ip_cidr_range = "10.48.0.0/14"
+               range_name    = "k8s-pods-range"
            },
+           {
+               ip_cidr_range = "10.52.0.0/18"
+               range_name    = "k8s-services-range"
            },
        ]
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
    }

  # google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = (known after apply)
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_l4_ilb_subsetting    = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       initial_node_count          = 1
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1-a"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "primary"
+       network                     = (known after apply)
+       networking_mode             = "VPC_NATIVE"
+       node_locations              = [
+           "us-central1-b",
+           "us-central1-c",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = (known after apply)
+       remove_default_node_pool    = true
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = (known after apply)
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           config_connector_config {
+               enabled = (known after apply)
            }

+           dns_cache_config {
+               enabled = (known after apply)
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = (known after apply)
            }

+           gke_backup_agent_config {
+               enabled = (known after apply)
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = true
            }

+           network_policy_config {
+               disabled = (known after apply)
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = (known after apply)

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               disk_size         = (known after apply)
+               disk_type         = (known after apply)
+               image_type        = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)

+               management {
+                   auto_repair     = (known after apply)
+                   auto_upgrade    = (known after apply)
+                   upgrade_options = (known after apply)
                }

+               shielded_instance_config {
+                   enable_integrity_monitoring = (known after apply)
+                   enable_secure_boot          = (known after apply)
                }

+               upgrade_settings {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
+                   strategy        = (known after apply)

+                   blue_green_settings {
+                       node_pool_soak_duration = (known after apply)

+                       standard_rollout_policy {
+                           batch_node_count    = (known after apply)
+                           batch_percentage    = (known after apply)
+                           batch_soak_duration = (known after apply)
                        }
                    }
                }
            }

+           resource_limits {
+               maximum       = (known after apply)
+               minimum       = (known after apply)
+               resource_type = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       cost_management_config {
+           enabled = (known after apply)
        }

+       database_encryption {
+           key_name = (known after apply)
+           state    = (known after apply)
        }

+       default_snat_status {
+           disabled = (known after apply)
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = "10.100.0.0/14"
+           cluster_secondary_range_name  = (known after apply)
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = (known after apply)
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = (known after apply)
            }
        }

+       master_authorized_networks_config {
+           gcp_public_cidrs_access_enabled = (known after apply)

+           cidr_blocks {
+               cidr_block   = "0.0.0.0/0"
+               display_name = "all-ip"
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)

+           managed_prometheus {
+               enabled = (known after apply)
            }
        }

+       node_config {
+           disk_size_gb      = 50
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           logging_variant   = "DEFAULT"
+           machine_type      = "e2-medium"
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = false
+           service_account   = (known after apply)
+           spot              = false
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = (known after apply)
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = (known after apply)
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           autoscaling {
+               location_policy      = (known after apply)
+               max_node_count       = (known after apply)
+               min_node_count       = (known after apply)
+               total_max_node_count = (known after apply)
+               total_min_node_count = (known after apply)
            }

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           network_config {
+               create_pod_range     = (known after apply)
+               enable_private_nodes = (known after apply)
+               pod_ipv4_cidr_block  = (known after apply)
+               pod_range            = (known after apply)
            }

+           node_config {
+               boot_disk_kms_key = (known after apply)
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = (known after apply)
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               logging_variant   = (known after apply)
+               machine_type      = (known after apply)
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               node_group        = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = (known after apply)
+               resource_labels   = (known after apply)
+               service_account   = (known after apply)
+               spot              = (known after apply)
+               tags              = (known after apply)
+               taint             = (known after apply)

+               gcfs_config {
+                   enabled = (known after apply)
                }

+               gvnic {
+                   enabled = (known after apply)
                }

+               kubelet_config {
+                   cpu_cfs_quota        = (known after apply)
+                   cpu_cfs_quota_period = (known after apply)
+                   cpu_manager_policy   = (known after apply)
                }

+               linux_node_config {
+                   sysctls = (known after apply)
                }

+               reservation_affinity {
+                   consume_reservation_type = (known after apply)
+                   key                      = (known after apply)
+                   values                   = (known after apply)
                }

+               shielded_instance_config {
+                   enable_integrity_monitoring = (known after apply)
+                   enable_secure_boot          = (known after apply)
                }

+               workload_metadata_config {
+                   mode = (known after apply)
                }
            }

+           placement_policy {
+               type = (known after apply)
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
+               strategy        = (known after apply)

+               blue_green_settings {
+                   node_pool_soak_duration = (known after apply)

+                   standard_rollout_policy {
+                       batch_node_count    = (known after apply)
+                       batch_percentage    = (known after apply)
+                       batch_soak_duration = (known after apply)
                    }
                }
            }
        }

+       node_pool_defaults {
+           node_config_defaults {
+               logging_variant = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = (known after apply)
+               topic   = (known after apply)

+               filter {
+                   event_type = (known after apply)
                }
            }
        }

+       private_cluster_config {
+           master_ipv4_cidr_block = (known after apply)
+           peering_name           = (known after apply)
+           private_endpoint       = (known after apply)
+           public_endpoint        = (known after apply)

+           master_global_access_config {
+               enabled = (known after apply)
            }
        }

+       release_channel {
+           channel = "REGULAR"
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       vertical_pod_autoscaling {
+           enabled = (known after apply)
        }

+       workload_identity_config {
+           workload_pool = "terrateam-demo.svc.id.goog"
        }
    }

  # google_container_node_pool.general will be created
+   resource "google_container_node_pool" "general" {
+       cluster                     = (known after apply)
+       id                          = (known after apply)
+       initial_node_count          = (known after apply)
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1-a"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "general"
+       name_prefix                 = (known after apply)
+       node_count                  = 1
+       node_locations              = (known after apply)
+       operation                   = (known after apply)
+       project                     = (known after apply)
+       version                     = (known after apply)

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       network_config {
+           create_pod_range     = (known after apply)
+           enable_private_nodes = (known after apply)
+           pod_ipv4_cidr_block  = (known after apply)
+           pod_range            = (known after apply)
        }

+       node_config {
+           disk_size_gb      = 10
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = {
+               "role" = "general"
            }
+           local_ssd_count   = (known after apply)
+           logging_variant   = "DEFAULT"
+           machine_type      = "e2-small"
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/cloud-platform",
            ]
+           preemptible       = false
+           service_account   = (known after apply)
+           spot              = false
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       upgrade_settings {
+           max_surge       = (known after apply)
+           max_unavailable = (known after apply)
+           strategy        = (known after apply)

+           blue_green_settings {
+               node_pool_soak_duration = (known after apply)

+               standard_rollout_policy {
+                   batch_node_count    = (known after apply)
+                   batch_percentage    = (known after apply)
+                   batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_container_node_pool.spot will be created
+   resource "google_container_node_pool" "spot" {
+       cluster                     = (known after apply)
+       id                          = (known after apply)
+       initial_node_count          = (known after apply)
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1-b"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "spot"
+       name_prefix                 = (known after apply)
+       node_count                  = 1
+       node_locations              = (known after apply)
+       operation                   = (known after apply)
+       project                     = (known after apply)
+       version                     = (known after apply)

+       autoscaling {
+           location_policy = (known after apply)
+           max_node_count  = 4
+           min_node_count  = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       network_config {
+           create_pod_range     = (known after apply)
+           enable_private_nodes = (known after apply)
+           pod_ipv4_cidr_block  = (known after apply)
+           pod_range            = (known after apply)
        }

+       node_config {
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = {
+               "role" = "spot"
+               "team" = "devops"
            }
+           local_ssd_count   = (known after apply)
+           logging_variant   = "DEFAULT"
+           machine_type      = "e2-small"
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/cloud-platform",
            ]
+           preemptible       = true
+           service_account   = (known after apply)
+           spot              = false
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       upgrade_settings {
+           max_surge       = (known after apply)
+           max_unavailable = (known after apply)
+           strategy        = (known after apply)

+           blue_green_settings {
+               node_pool_soak_duration = (known after apply)

+               standard_rollout_policy {
+                   batch_node_count    = (known after apply)
+                   batch_percentage    = (known after apply)
+                   batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_project_service.cloudresourcemanager will be created
+   resource "google_project_service" "cloudresourcemanager" {
+       disable_dependent_services = true
+       disable_on_destroy         = true
+       id                         = (known after apply)
+       project                    = "terrateam-demo"
+       service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.compute will be created
+   resource "google_project_service" "compute" {
+       disable_dependent_services = true
+       disable_on_destroy         = true
+       id                         = (known after apply)
+       project                    = "terrateam-demo"
+       service                    = "compute.googleapis.com"
    }

  # google_project_service.container will be created
+   resource "google_project_service" "container" {
+       disable_dependent_services = true
+       disable_on_destroy         = true
+       id                         = (known after apply)
+       project                    = "terrateam-demo"
+       service                    = "container.googleapis.com"
    }

  # google_service_account.kubernetes will be created
+   resource "google_service_account" "kubernetes" {
+       account_id = "kubernetes"
+       disabled   = false
+       email      = (known after apply)
+       id         = (known after apply)
+       member     = (known after apply)
+       name       = (known after apply)
+       project    = (known after apply)
+       unique_id  = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| | **Total** | **120.90** | **120.90** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
